requestNome.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://indracompany.com/treinamento/wsbase">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getClientePorNomeRequest>
         <gs:nome>Vanessa Joana da Silva</gs:nome>
      </gs:getClientePorNomeRequest>
   </soapenv:Body>
</soapenv:Envelope>